{
    "@context": "https://schema.org",
    "@type": "ItemList",
    "name": "SovereignSky Audiences",
    "description": "Target audiences for content, events, and software recommendations",
    "itemListElement": [
        {
            "@type": "Audience",
            "audienceType": "all",
            "name": "Everyone",
            "disambiguatingDescription": "General content for all audiences",
            "description": "Content relevant to everyone interested in digital sovereignty, regardless of role or background.",
            "icon": "users"
        },
        {
            "@type": "Audience",
            "audienceType": "developer",
            "name": "Developers",
            "disambiguatingDescription": "Software developers and engineers building applications and systems",
            "description": "You hold the keys to Norway's digital independence. Your technical choices — open standards over vendor SDKs, containers over serverless, portable databases — determine whether critical services can function on their own. Every line of code is a vote for sovereignty.",
            "icon": "code"
        },
        {
            "@type": "Audience",
            "audienceType": "it-ops",
            "name": "IT & Operations",
            "disambiguatingDescription": "IT administrators and operations teams managing infrastructure, security, and monitoring",
            "description": "You manage the infrastructure Norway depends on. When ministers call for exit strategies, you're the one who knows where every dependency lives. Map your systems, document your providers, and build the resilience that keeps critical services running — no matter what happens in Washington.",
            "icon": "server"
        },
        {
            "@type": "Audience",
            "audienceType": "enterprise",
            "name": "Enterprise",
            "disambiguatingDescription": "Business managers and decision makers",
            "description": "What happens to your business when you can't access your systems? With 81% of Norwegian cloud running on US platforms, your exit strategy is a boardroom issue. The companies that will survive geopolitical disruption are those planning for it today — not scrambling when the lock-out notice arrives.",
            "icon": "building"
        },
        {
            "@type": "Audience",
            "audienceType": "public-sector",
            "name": "Public Sector",
            "disambiguatingDescription": "Government and public administration",
            "description": "Hospitals need to admit patients. Ambulances need GPS. Pensions need to be paid. You keep society running — and 96% of Norwegian state agencies now depend on cloud services subject to foreign law. When the minister calls for exit strategies, she's talking about your systems. Prepare now, because citizens are counting on you.",
            "icon": "flag"
        },
        {
            "@type": "Audience",
            "audienceType": "humanitarian",
            "name": "Humanitarian",
            "disambiguatingDescription": "NGOs and aid organizations",
            "description": "When crisis strikes, you're the ones who show up. You coordinate volunteers, locate the vulnerable, deliver aid. But your contact lists, your volunteer databases, your coordination tools — they're all on servers controlled by a foreign power. No one has physical archives anymore. If you can't organize, you can't help. Build your digital independence now, before the crisis that needs you arrives.",
            "icon": "heart-handshake"
        },
        {
            "@type": "Audience",
            "audienceType": "security",
            "name": "Security & Defence",
            "disambiguatingDescription": "Military, police, intelligence, and civil protection",
            "description": "Military, police, intelligence, and civil protection organizations requiring high-assurance, sovereign solutions for sensitive operations.",
            "icon": "shield-check"
        },
        {
            "@type": "Audience",
            "audienceType": "consumer",
            "name": "Consumers",
            "disambiguatingDescription": "End users and general public",
            "description": "End users and the general public looking for privacy-respecting everyday apps and services as alternatives to Big Tech.",
            "icon": "user"
        }
    ]
}