{
  "blocs": [
    {
      "identifier": "eu",
      "name": "European Union",
      "slug": "eu",
      "flag": "🇪🇺",
      "description": "The European Union provides comprehensive data protection through GDPR and related regulations. EU member states share a common legal framework for privacy and data handling.",
      "members": [
        "AT",
        "BE",
        "BG",
        "HR",
        "CY",
        "CZ",
        "DK",
        "EE",
        "FI",
        "FR",
        "DE",
        "GR",
        "HU",
        "IE",
        "IT",
        "LV",
        "LT",
        "LU",
        "MT",
        "NL",
        "PL",
        "PT",
        "RO",
        "SK",
        "SI",
        "ES",
        "SE"
      ],
      "laws": [
        "gdpr",
        "data-act",
        "ai-act"
      ],
      "riskLevel": "low"
    },
    {
      "identifier": "eea",
      "name": "European Economic Area",
      "slug": "eea",
      "flag": "🇪🇺",
      "description": "The EEA extends the EU single market to Norway, Iceland, and Liechtenstein. These countries adopt EU regulations including GDPR through the EEA Agreement.",
      "members": [
        "NO",
        "IS",
        "LI"
      ],
      "laws": [
        "eea-agreement"
      ],
      "riskLevel": "low",
      "inheritsFrom": [
        "eu"
      ]
    },
    {
      "identifier": "EU_EEA",
      "name": "EU/EEA Region",
      "slug": "eu-eea",
      "flag": "🇪🇺",
      "description": "Combined European Union and European Economic Area. Used for data residency purposes when a vendor offers 'EU data residency' without specifying exact countries. Includes all 27 EU member states plus Norway, Iceland, and Liechtenstein.",
      "members": [],
      "laws": [],
      "riskLevel": "low",
      "inheritsFrom": [
        "eea"
      ],
      "notes": "Virtual bloc for data residency classification. Inherits all members and laws from EEA (which inherits from EU)."
    },
    {
      "identifier": "five-eyes",
      "name": "Five Eyes",
      "slug": "five-eyes",
      "flag": "👁️",
      "description": "Intelligence alliance between Australia, Canada, New Zealand, United Kingdom, and United States. Members share signals intelligence and have mutual legal assistance treaties enabling cross-border data access.",
      "members": [
        "US",
        "GB",
        "CA",
        "AU",
        "NZ"
      ],
      "laws": [],
      "riskLevel": "elevated",
      "notes": "While an intelligence-sharing alliance rather than a legal framework, Five Eyes membership indicates close cooperation on surveillance and data access between member nations."
    },
    {
      "identifier": "adequacy",
      "name": "EU Adequacy Decisions",
      "slug": "adequacy",
      "flag": "✓",
      "description": "Countries recognized by the European Commission as providing adequate data protection, allowing free flow of personal data from the EU without additional safeguards.",
      "members": [
        "AD",
        "AR",
        "CA",
        "FO",
        "GG",
        "IL",
        "IM",
        "JP",
        "JE",
        "NZ",
        "KR",
        "CH",
        "GB",
        "UY"
      ],
      "laws": [],
      "riskLevel": "low",
      "notes": "Adequacy decisions can be challenged or revoked. The US Data Privacy Framework (2023) replaced Privacy Shield after Schrems II invalidation."
    }
  ],
  "riskLevels": {
    "low": {
      "label": "Low Risk",
      "color": "green",
      "description": "Strong data protection laws aligned with GDPR. No extraterritorial data access concerns.",
      "mapColor": "#22c55e"
    },
    "moderate": {
      "label": "Moderate Risk",
      "color": "yellow",
      "description": "Generally adequate protection with some surveillance capabilities or legal uncertainties.",
      "mapColor": "#eab308"
    },
    "elevated": {
      "label": "Elevated Risk",
      "color": "orange",
      "description": "Significant surveillance laws or extraterritorial data access capabilities. Consider mitigations.",
      "mapColor": "#f97316"
    },
    "high": {
      "label": "High Risk",
      "color": "red",
      "description": "Broad government access to data, weak privacy protections, or extraterritorial reach. Avoid for sensitive data.",
      "mapColor": "#ef4444"
    },
    "sanctioned": {
      "label": "Sanctioned",
      "color": "darkred",
      "description": "Subject to international sanctions. Business relationships may be legally restricted.",
      "mapColor": "#991b1b"
    }
  },
  "meta": {
    "version": "1.0",
    "updated": "2025-12-19",
    "description": "Jurisdictional blocs and risk level definitions for SovereignSky"
  }
}